# https://docs.brew.sh/Brew-Bundle-and-Brewfile

tap "warrensbox/tap"
tap "charmbracelet/tap"
tap "siderolabs/tap"

# Base workstation tools
# brew "msedit"
brew "bash-completion"
brew "direnv"
brew "thefuck"
brew "zoxide"
brew "bat"
brew "lsd"
# brew "jq"
brew "yq"
brew "cowsay"
brew "starship"
brew "btop"
brew "gdu"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"


# DevOps / Development and Infrastructure management tools
brew "charmbracelet/tap/melt"
brew "doppler"
brew "gh"
brew "lazygit"
brew "siderolabs/tap/sidero-tools"
# brew "talosctl" # Included with sidero-tools
# brew "omnictl" # Included with sidero-tools
# brew "kubectl" # Included with sidero-tools
# brew "kubectl-oidc_login" # Included with sidero-tools
brew "kustomize"
brew "helm"
brew "warrensbox/tap/tfswitch" # https://tfswitch.warrensbox.com/
brew "go"
brew "python@3.12"
brew "python-tk@3.12"
brew "deno"
brew "fnm" # https://github.com/Schniz/fnm
brew "pnpm"
brew "hugo"

# Media tools
brew "ffmpeg"
brew "imagemagick"

# Comms
flatpak "org.signal.Signal", remote: "signal-flatpak", url: "https://signalflatpak.github.io/signal" # https://docs.projectbluefin.io/blog/flatpak-support-in-brewfiles/
